import React from 'react'
import Container from 'react-bootstrap/Container';
import Row from 'react-bootstrap/Row';
import Col from 'react-bootstrap/Col';
import Alert from 'react-bootstrap/Alert';
import Image from 'react-bootstrap/Image';
import TitleBlock from './TitleBlock';

export default function Info() {
  return (
    <Container>
      <Row>
         <Col>
         <TitleBlock link="about" title="Про заклад"/>
         </Col>
         </Row>
         <Alert variant="primary">
            <Image className="d-block mx-auto" src="info/school.jpg"></Image>
         <Row>
            <Col>
         <p>Школа<strong> забезпечує корекційну спрямованість навчально-виховного процесу, лікувально-профілактичну, відновлювальну і оздоровчу роботу</strong> для вихованців віком <strong>від 7 до 17 років.</strong> У ній проводяться <strong>корекційно-відновлювальні заняття</strong> з предметно-практичного навчання, <strong>лікувальної фізкультури, логопедії, ритміки, соціально-побутової орієнтації.</strong> Здійснюється <strong>трудове навчання</strong> за профілями: швейна, столярна справа та квітникарство.</p>
         </Col></Row>
      <Row> 
     
         <Col md="6">
         <p><strong>До закладу зараховуються:</strong><br></br>
діти <strong>з порушенням інтелектуального розвитку</strong> з 6(7) років та
діти <strong>з відповідним діагнозом</strong> з такими медичними показаннями:
         <ul>
            <li>легка розумова відсталість;</li>
            <li>помірна розумова відсталість;</li>
            <li>органічна деменція різного походження,яка відповідає легкійта помірній розумовій відсталості;</li>
            <li>розумова відсталість у поєднанні з раннім дитячим аутизмом, з тяжкими порушеннями мовлення.</li>
         </ul>
</p>
         </Col>
         <Col md="6">
         <p>Для створення оптимальних умов <strong>фізичного, психічного, інтелектуального розвитку дітей з особливими освітніми потребами</strong>, реабілітація в закладі носить комплексний характер і забезпечується поєднанням <strong>спеціального супроводу</strong>
<ul>
   <li>педагогічного ( корекційного );</li>
   <li>психологічного;</li>
   <li>соціального;</li>
   <li>медичного;</li>
   <li>професійно – трудового.</li>
</ul></p>
         </Col>
        
      </Row>
      

   <Row>
   <Col>
<p>Активно працюють <strong>спортивні секції</strong> (баскетбол, футбол, настільний теніс, легка атлетика), <strong>20 гуртків за інтересами.</strong> Діти в’яжуть, вишивають, роблять м’які іграшки, майстерно готують тістечка, різні страви, вчаться робити вироби з природнього матеріалу, паперу, дерева та інші.</p>
         </Col>
         </Row>
      </Alert>
    </Container>
  )
}
